<div style="border-radius: 15px; border: 3px solid black; padding: 15px;">
    
<font size=+2><b> Проект по SQL. </b></font>
    
Произведён анализ базы данных крупного сервиса для чтения книг по подписке. В ней — информация о книгах, издательствах, авторах, а также пользовательские обзоры книг. Эти данные помогут сформулировать ценностное предложение для нового продукта.

Цели исследования: подключиться к внешней базе данных, написать SQL-запросы, вывести запрашиваемые данные в тетрадь проекта. На основании полученных данных сформулировать выводы об интересующих аспектах книжного рынка в данный момент.    
    
</div>

<div style="border-radius: 15px; border: 3px solid black; padding: 15px;">
    
<font size=+2><b> ЗАГРУЗКА ДАННЫХ. </b></font>

<font size=+1><b> 1. Таблица books. </b></font>
    
Содержит данные о книгах:
- 'book_id' — идентификатор книги;
- 'author_id' — идентификатор автора;
- 'title' — название книги;
- 'num_pages' — количество страниц;
- 'publication_date' — дата публикации книги;
- 'publisher_id' — идентификатор издателя.
    
</div>

In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
db_config = {'user': 'praktikum_student', # имя пользователя
             'pwd': 'Sdf4$2;d-d30pp', # пароль
             'host': 'rc1b-wcoijxj3yxfsf3fs.mdb.yandexcloud.net',
             'port': 6432, # порт подключения
             'db': 'data-analyst-final-project-db'} # название базы данных

connection_string = 'postgresql://{}:{}@{}:{}/{}'.format(db_config['user'],
                                                         db_config['pwd'],
                                                         db_config['host'],
                                                         db_config['port'],
                                                         db_config['db'])

engine = create_engine(connection_string, connect_args={'sslmode':'require'})

In [3]:
query_books = '''SELECT *
                 FROM books
              '''

In [4]:
books = pd.io.sql.read_sql(query_books, con = engine)

books.head()

,book_id,author_id,title,num_pages,publication_date,publisher_id
0,1,546,'Salem's Lot,594,2005-11-01,93
1,2,465,1 000 Places to See Before You Die,992,2003-05-22,336
2,3,407,13 Little Blue Envelopes (Little Blue Envelope...,322,2010-12-21,135
3,4,82,1491: New Revelations of the Americas Before C...,541,2006-10-10,309
4,5,125,1776,386,2006-07-04,268

<div style="border-radius: 15px; border: 3px solid black; padding: 15px;">
    
<font size=+1><b> 2. Таблица authors. </b></font>
    
Содержит данные об авторах:
- 'author_id' — идентификатор автора;
- 'author' — имя автора.
    
</div>

In [5]:
query_authors = '''SELECT *
                   FROM authors
                   LIMIT 5
                '''

In [6]:
authors = pd.io.sql.read_sql(query_authors, con = engine)

authors

   author_id                          author
0          1                      A.S. Byatt
1          2  Aesop/Laura Harris/Laura Gibbs
2          3                 Agatha Christie
3          4                   Alan Brennert
4          5        Alan Moore/David   Lloyd

<div style="border-radius: 15px; border: 3px solid black; padding: 15px;">
    
<font size=+1><b> 3. Таблица publishers. </b></font>
    
Содержит данные об издательствах:
- 'publisher_id' — идентификатор издательства;
- 'publisher' — название издательства.
    
</div>

In [7]:
query_publishers = '''SELECT *
                      FROM publishers
                      LIMIT 5
                   '''

In [8]:
publishers = pd.io.sql.read_sql(query_publishers, con = engine)

publishers

   publisher_id                          publisher
0             1                                Ace
1             2                           Ace Book
2             3                          Ace Books
3             4                      Ace Hardcover
4             5  Addison Wesley Publishing Company

<div style="border-radius: 15px; border: 3px solid black; padding: 15px;">
    
<font size=+1><b> 4. Таблица ratings. </b></font>
    
Содержит данные о пользовательских оценках книг:
- 'rating_id' — идентификатор оценки;
- 'book_id' — идентификатор книги;
- 'username' — имя пользователя, оставившего оценку;
- 'rating' — оценка книги.
    
</div>

In [9]:
query_ratings = '''SELECT *
                   FROM ratings
                '''

In [10]:
ratings = pd.io.sql.read_sql(query_ratings, con = engine)

ratings.head()

   rating_id  book_id       username  rating
0          1        1     ryanfranco       4
1          2        1  grantpatricia       2
2          3        1   brandtandrea       5
3          4        2       lorichen       3
4          5        2    mariokeller       2

<div style="border-radius: 15px; border: 3px solid black; padding: 15px;">
    
<font size=+1><b> 5. Таблица reviews. </b></font>
    
Содержит данные о пользовательских обзорах на книги:
- 'review_id' — идентификатор обзора;
- 'book_id' — идентификатор книги;
- 'username' — имя пользователя, написавшего обзор;
- 'text' — текст обзора.
    
</div>

In [11]:
query_reviews = '''SELECT *
                   FROM reviews
                '''

In [12]:
reviews = pd.io.sql.read_sql(query_reviews, con = engine)

reviews.head()

,review_id,book_id,username,text
0,1,1,brandtandrea,Mention society tell send professor analysis. ...
1,2,1,ryanfranco,Foot glass pretty audience hit themselves. Amo...
2,3,2,lorichen,Listen treat keep worry. Miss husband tax but ...
3,4,3,johnsonamanda,Finally month interesting blue could nature cu...
4,5,3,scotttamara,Nation purpose heavy give wait song will. List...

<div style="border-radius: 15px; border: 3px solid black; padding: 15px;">
    
<font size=+2><b> ЗАДАЧА 1. </b></font>

Посчитайте, сколько книг вышло после 1 января 2000 года.
    
По результатам данного запроса можно сказать, что в распоряжении купленного сервиса достаточно большое количество - 819 из 1000 - современных книг.
    
</div>

In [13]:
query_1 = '''SELECT COUNT(book_id)
             FROM books
             WHERE publication_date > '2000-01-01';
          '''

In [14]:
total_books = pd.io.sql.read_sql(query_1, con = engine)

total_books

   count
0    819

In [15]:
books.shape

(1000, 6)

<div style="border-radius: 15px; border: 3px solid black; padding: 15px;">
    
<font size=+2><b> ЗАДАЧА 2. </b></font>

Для каждой книги посчитайте количество обзоров и среднюю оценку.
    
По итогам данного запроса у нас есть информация о количестве обзоров на каждую книгу и её средней оценке. Теперь можно сортировать книги по популярности или рейтингу.
    
</div>

In [16]:
query_2 = '''SELECT b.book_id,
                    b.title,
                    COUNT(DISTINCT rev.review_id),
                    ROUND(AVG(rat.rating), 2)
             FROM books b
             LEFT JOIN reviews rev ON b.book_id = rev.book_id
             LEFT JOIN ratings rat ON b.book_id = rat.book_id
             GROUP BY 1
             ORDER BY 1;
          '''

In [17]:
reviews_and_rates = pd.io.sql.read_sql(query_2, con = engine)

reviews_and_rates

     book_id                                              title  count  round
0          1                                       'Salem's Lot      2   3.67
1          2                 1 000 Places to See Before You Die      1   2.50
2          3  13 Little Blue Envelopes (Little Blue Envelope...      3   4.67
3          4  1491: New Revelations of the Americas Before C...      2   4.50
4          5                                               1776      4   4.00
..       ...                                                ...    ...    ...
995      996           Wyrd Sisters (Discworld  #6; Witches #2)      3   3.67
996      997                        Xenocide (Ender's Saga  #3)      3   3.40
997      998                                    Year of Wonders      4   3.20
998      999                        You Suck (A Love Story  #2)      2   4.50
999     1000  Zen and the Art of Motorcycle Maintenance: An ...      4   3.83

[1000 rows x 4 columns]

In [18]:
#альтернативное решение

query_2_2 = '''WITH rev AS (SELECT book_id,
                                   COUNT(review_id) AS review_count
                            FROM reviews
                            GROUP BY 1),
               rat AS (SELECT book_id,
                              ROUND(AVG(rating), 2) AS rating_avg
                       FROM ratings
                       GROUP BY 1)
               
               SELECT b.book_id,
                      b.title,
                      rev.review_count,
                      rat.rating_avg
               FROM books b
               LEFT JOIN rev ON b.book_id = rev.book_id
               LEFT JOIN rat ON b.book_id = rat.book_id
               ORDER BY 1;
          '''

In [19]:
#альтернативное решение

reviews_and_rates_2 = pd.io.sql.read_sql(query_2_2, con = engine)

reviews_and_rates_2

,book_id,title,review_count,rating_avg
0,1,'Salem's Lot,2.0,3.67
1,2,1 000 Places to See Before You Die,1.0,2.50
2,3,13 Little Blue Envelopes (Little Blue Envelope...,3.0,4.67
3,4,1491: New Revelations of the Americas Before C...,2.0,4.50
4,5,1776,4.0,4.00
...,...,...,...,...
995,996,Wyrd Sisters (Discworld #6; Witches #2),3.0,3.67
996,997,Xenocide (Ender's Saga #3),3.0,3.40
997,998,Year of Wonders,4.0,3.20
998,999,You Suck (A Love Story #2),2.0,4.50
999,1000,Zen and the Art of Motorcycle Maintenance: An ...,4.0,3.83

<div style="border-radius: 15px; border: 3px solid black; padding: 15px;">
    
<font size=+2><b> ЗАДАЧА 3. </b></font>

Определите издательство, которое выпустило наибольшее число книг толще 50 страниц — так вы исключите из анализа брошюры.

Больше всего книг выпустило издательство Penguin Books - 42 штуки. Возможно, стоит рассмотреть более тесные варианты сотрудничества с данным издательством или наоборот, уделить большее внимание другим издательствам.    
    
</div>

In [20]:
query_3 = '''SELECT p.publisher,
                    COUNT(book_id) AS book_count
             FROM books b
             LEFT JOIN publishers p ON b.publisher_id = p.publisher_id
             WHERE b.num_pages > 50
             GROUP BY p.publisher
             ORDER BY book_count DESC
             LIMIT 1;
          '''

In [21]:
reviews_and_raits = pd.io.sql.read_sql(query_3, con = engine)

reviews_and_raits

       publisher  book_count
0  Penguin Books          42

<div style="border-radius: 15px; border: 3px solid black; padding: 15px;">
    
<font size=+2><b> ЗАДАЧА 4. </b></font>

Определите автора с самой высокой средней оценкой книг — учитывайте только книги с 50 и более оценками.

Этим автором оказалась Джоан Роулинг со средней пользовательской оценкой в 4.28.
    
Что интересно, в запросе она указана вместе с иллюстратором Mary GrandPré - возможно, средняя оценка высчитана не для всех книг Роулинг, а только для тех, которые выпущены с иллюстрациями Мари.    
    
</div>

In [22]:
query_4 = '''WITH rating_info AS (SELECT b.book_id,
                                         b.author_id,
                                         COUNT(r.rating) as rating_count,
                                         AVG(r.rating) as mean_rating
                                  FROM books b
                                  LEFT JOIN ratings r ON b.book_id = r.book_id
                                  GROUP BY 1)
             SELECT a.author,
                    ROUND(AVG(ri.mean_rating), 2) AS mean_author_rating
             FROM rating_info ri
             LEFT JOIN authors a ON ri.author_id = a.author_id
             WHERE rating_count >= 50
             GROUP BY 1
             ORDER BY 2 DESC
             LIMIT 1;
          '''

In [23]:
highscore_author = pd.io.sql.read_sql(query_4, con = engine)

highscore_author

                       author  mean_author_rating
0  J.K. Rowling/Mary GrandPré                4.28

<div style="border-radius: 15px; border: 3px solid black; padding: 15px;">
    
<font size=+2><b> ЗАДАЧА 5. </b></font>

Посчитайте среднее количество обзоров от пользователей, которые поставили больше 50 оценок.
    
Продуктивные пользователи, поставившие больше 50 оценок, менее охотно пишут развёртнутые отзывы - в среднем в два раза меньше, а именно 24 штуки.
    
</div>

In [24]:
query_5 = '''WITH user_ratings AS (SELECT username,
                                         COUNT(rating_id) as rating_count                    
                                   FROM ratings
                                   GROUP BY 1
                                   HAVING COUNT(rating_id) > 50),
             
             user_reviews AS (SELECT username,
                                     COUNT(review_id) as review_count 
                              FROM reviews
                              GROUP BY 1)
             
             SELECT ROUND(AVG(rev.review_count), 2) AS mean_review_count
             FROM user_ratings rat
             LEFT JOIN user_reviews rev ON rat.username = rev.username;
          '''

In [25]:
highscore_poster = pd.io.sql.read_sql(query_5, con = engine)

highscore_poster

   mean_review_count
0              24.33

<div style="border-radius: 15px; border: 3px solid black; padding: 15px;">
    
<font size=+2><b> ВЫВОДЫ. </b></font>

В данном проекте нам удалось рассмотреть и проанализировать данные из базы данных купленного сервиса по чтению книг по подписке. В ней указаны 1000 книг в основном современных изданий, разных издательств и авторов. У клиентов сервиса есть возможность ставить оценки и оставлять отзывы. Коммьюнити достаточно активно: есть пользователи, оставившие по несколько десятков оценок и отзывов.
    
</div>